base/redis_bench_result/set_256_6404.log
2023-11-24 14:17:04
====== SET ======
  4000016 requests completed in 49.48 seconds
  32 parallel clients
  256 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.04% <= 0.2 milliseconds
0.64% <= 0.3 milliseconds
1.82% <= 0.4 milliseconds
4.11% <= 0.5 milliseconds
8.09% <= 0.6 milliseconds
14.11% <= 0.7 milliseconds
22.00% <= 0.8 milliseconds
29.43% <= 0.9 milliseconds
35.68% <= 1.0 milliseconds
40.93% <= 1.1 milliseconds
45.13% <= 1.2 milliseconds
48.42% <= 1.3 milliseconds
51.19% <= 1.4 milliseconds
53.73% <= 1.5 milliseconds
56.02% <= 1.6 milliseconds
57.99% <= 1.7 milliseconds
59.65% <= 1.8 milliseconds
61.13% <= 1.9 milliseconds
62.51% <= 2 milliseconds
71.35% <= 3 milliseconds
77.53% <= 4 milliseconds
82.24% <= 5 milliseconds
86.08% <= 6 milliseconds
88.90% <= 7 milliseconds
91.18% <= 8 milliseconds
92.79% <= 9 milliseconds
94.06% <= 10 milliseconds
95.21% <= 11 milliseconds
96.11% <= 12 milliseconds
96.74% <= 13 milliseconds
97.25% <= 14 milliseconds
97.68% <= 15 milliseconds
98.05% <= 16 milliseconds
98.34% <= 17 milliseconds
98.63% <= 18 milliseconds
98.79% <= 19 milliseconds
98.94% <= 20 milliseconds
99.10% <= 21 milliseconds
99.23% <= 22 milliseconds
99.33% <= 23 milliseconds
99.41% <= 24 milliseconds
99.48% <= 25 milliseconds
99.56% <= 26 milliseconds
99.60% <= 27 milliseconds
99.66% <= 28 milliseconds
99.72% <= 29 milliseconds
99.77% <= 30 milliseconds
99.80% <= 31 milliseconds
99.83% <= 32 milliseconds
99.86% <= 33 milliseconds
99.88% <= 34 milliseconds
99.89% <= 35 milliseconds
99.90% <= 36 milliseconds
99.91% <= 37 milliseconds
99.92% <= 38 milliseconds
99.93% <= 39 milliseconds
99.93% <= 40 milliseconds
99.95% <= 41 milliseconds
99.96% <= 42 milliseconds
99.96% <= 43 milliseconds
99.97% <= 44 milliseconds
99.97% <= 45 milliseconds
99.97% <= 46 milliseconds
99.97% <= 47 milliseconds
99.98% <= 48 milliseconds
99.98% <= 50 milliseconds
99.98% <= 51 milliseconds
99.98% <= 55 milliseconds
99.99% <= 59 milliseconds
99.99% <= 71 milliseconds
99.99% <= 72 milliseconds
99.99% <= 73 milliseconds
99.99% <= 74 milliseconds
99.99% <= 79 milliseconds
99.99% <= 80 milliseconds
100.00% <= 81 milliseconds
100.00% <= 89 milliseconds
100.00% <= 91 milliseconds
100.00% <= 92 milliseconds
100.00% <= 92 milliseconds
80834.53 requests per second