base/redis_bench_result/set_64_6383.log
2023-11-24 12:39:49
====== SET ======
  20000000 requests completed in 248.91 seconds
  32 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.02% <= 0.2 milliseconds
0.67% <= 0.3 milliseconds
2.01% <= 0.4 milliseconds
3.81% <= 0.5 milliseconds
6.59% <= 0.6 milliseconds
12.14% <= 0.7 milliseconds
19.33% <= 0.8 milliseconds
25.46% <= 0.9 milliseconds
31.37% <= 1.0 milliseconds
37.09% <= 1.1 milliseconds
42.09% <= 1.2 milliseconds
45.84% <= 1.3 milliseconds
48.64% <= 1.4 milliseconds
50.92% <= 1.5 milliseconds
52.92% <= 1.6 milliseconds
54.71% <= 1.7 milliseconds
56.35% <= 1.8 milliseconds
57.91% <= 1.9 milliseconds
59.37% <= 2 milliseconds
71.01% <= 3 milliseconds
78.80% <= 4 milliseconds
84.00% <= 5 milliseconds
87.57% <= 6 milliseconds
90.13% <= 7 milliseconds
92.00% <= 8 milliseconds
93.43% <= 9 milliseconds
94.51% <= 10 milliseconds
95.38% <= 11 milliseconds
96.11% <= 12 milliseconds
96.66% <= 13 milliseconds
97.16% <= 14 milliseconds
97.60% <= 15 milliseconds
98.04% <= 16 milliseconds
98.31% <= 17 milliseconds
98.54% <= 18 milliseconds
98.73% <= 19 milliseconds
98.91% <= 20 milliseconds
99.06% <= 21 milliseconds
99.19% <= 22 milliseconds
99.30% <= 23 milliseconds
99.39% <= 24 milliseconds
99.48% <= 25 milliseconds
99.54% <= 26 milliseconds
99.61% <= 27 milliseconds
99.67% <= 28 milliseconds
99.71% <= 29 milliseconds
99.75% <= 30 milliseconds
99.77% <= 31 milliseconds
99.79% <= 32 milliseconds
99.82% <= 33 milliseconds
99.84% <= 34 milliseconds
99.85% <= 35 milliseconds
99.86% <= 36 milliseconds
99.87% <= 37 milliseconds
99.89% <= 38 milliseconds
99.90% <= 39 milliseconds
99.91% <= 40 milliseconds
99.92% <= 41 milliseconds
99.93% <= 42 milliseconds
99.94% <= 43 milliseconds
99.94% <= 44 milliseconds
99.95% <= 45 milliseconds
99.95% <= 46 milliseconds
99.95% <= 47 milliseconds
99.96% <= 48 milliseconds
99.96% <= 49 milliseconds
99.96% <= 50 milliseconds
99.97% <= 51 milliseconds
99.97% <= 52 milliseconds
99.97% <= 53 milliseconds
99.97% <= 54 milliseconds
99.98% <= 55 milliseconds
99.98% <= 56 milliseconds
99.98% <= 57 milliseconds
99.98% <= 58 milliseconds
99.98% <= 59 milliseconds
99.98% <= 60 milliseconds
99.99% <= 61 milliseconds
99.99% <= 62 milliseconds
99.99% <= 63 milliseconds
99.99% <= 64 milliseconds
99.99% <= 65 milliseconds
99.99% <= 66 milliseconds
99.99% <= 67 milliseconds
99.99% <= 68 milliseconds
99.99% <= 69 milliseconds
100.00% <= 70 milliseconds
100.00% <= 71 milliseconds
100.00% <= 73 milliseconds
100.00% <= 75 milliseconds
100.00% <= 77 milliseconds
100.00% <= 127 milliseconds
100.00% <= 127 milliseconds
80351.30 requests per second